tap "cloudflare/cloudflare"
tap "common-fate/granted"
tap "espanso/espanso"
tap "heroku/brew"
tap "hettysoft/tap"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "libsql/sqld"
tap "moncho/dry"
tap "oven-sh/bun"
tap "pkgxdev/made"
tap "Qovery/replibyte"
tap "teamookla/speedtest"
tap "tursodatabase/tap"

brew "ack"                         # search tool https://beyondgrep.com/
brew "ansible"                     # ansible cli https://www.ansible.com/
brew "asciinema"                   # record & share terminal session https://asciinema.org/
brew "automake"                    # makefile generator https://www.gnu.org/software/automake/
brew "aws-sam-cli"                 # aws sam https://aws.amazon.com/serverless/sam/
brew "aws-vault"                   # aws secret storage https://github.com/99designs/aws-vault
brew "bat"                         # styled cat https://github.com/sharkdp/bat
brew "bazel"                       # build tool https://bazel.build/
brew "broot"                       # navigate directory trees https://dystroy.org/broot/
brew "bun"                         # bun runtime & cli https://github.com/oven-sh/bun
brew "caddy"                       # web server with https https://caddyserver.com/
brew "cfn-lint"                    # cloudformation linter https://github.com/aws-cloudformation/cfn-lint/
brew "cloudflared"                 # cloudflare tunel client https://github.com/cloudflare/cloudflared
brew "cmake"                       # cross-platform make https://cmake.org/
brew "cmocka"                      # unit testing framework https://cmocka.org/
brew "coredns"                     # dns server https://coredns.io/
brew "coreutils"                   # https://www.gnu.org/software/coreutils/
brew "curl"                        # https://curl.se/
brew "docker-slim"                 # docker image optimizer https://slimtoolkit.org/
brew "dry"                         # docker manager cli https://github.com/moncho/dry
brew "ffmpeg"                      # media tool https://ffmpeg.org/
brew "flyctl"                      # fly.io cli https://fly.io/
brew "fswatch"                     # file change monitor https://github.com/emcrisostomo/fswatch
brew "fx"                          # json processing https://github.com/antonmedv/fx
brew "gh"                          # github cli https://cli.github.com
brew "git-lfs"                     # versioning large files https://github.com/git-lfs/git-lfs
brew "git"                         # git https://git-scm.com/
brew "gnupg"                       # privacy package https://gnupg.org/
brew "go"                          # https://go.dev/
brew "gobject-introspection"       # https://gi.readthedocs.io/en/latest/
brew "gping"                       # ping with graph https://github.com/orf/gping
brew "granted"                     # cloud access manager https://github.com/common-fate/granted
brew "guile"                       # https://www.gnu.org/software/guile/
brew "h2o"                         # HTTP/1.x and HTTP/2 server https://github.com/h2o/h2o/
brew "hasura-cli"                  # hasura cli https://hasura.io/
brew "helm"                        # k8s package manager https://helm.sh/
brew "heroku"                      # heroku cli https://www.heroku.com/
brew "hetty"                       # http toolkit https://github.com/dstotijn/hetty
brew "hss"                         # parallel ssh client https://github.com/six-ddc/hss
brew "http-server"                 # https://github.com/http-party/http-server
brew "httpie"                      # cURL replacement https://httpie.io/
brew "httrack"                     # website copier https://www.httrack.com/
brew "hwloc"                       # https://www.open-mpi.org/projects/hwloc/
brew "iftop"                       # interface bandwidth usage https://www.ex-parrot.com/~pdw/iftop/
brew "imagemagick"                 # manipulate images https://imagemagick.org/index.php
brew "iperf3"                      # mesure tcp, udp bandwidth https://github.com/esnet/iperf
brew "jless"                       # cli JSON viewer https://github.com/PaulJuliusMartinez/jless
brew "jpeg"                        # image manipulation https://www.ijg.org/
brew "jq"                          # JSON processor https://stedolan.github.io/jq/
brew "k6"                          # load testing https://k6.io/
brew "k9s"                         # k8s cli/ui https://k9scli.io/
brew "kind"                        # local k8s cluster https://kind.sigs.k8s.io/
brew "krew"                        # kubectl plugins manager https://sigs.k8s.io/krew/
brew "kubectx"                     # mange k8s ctx https://github.com/ahmetb/kubectx
brew "kubergrunt"                  # https://github.com/gruntwork-io/kubergrunt
brew "kubernetes-cli"              # kubectl https://kubernetes.io/
brew "kubespy"                     # observing k8s resources in realtime https://github.com/pulumi/kubespy
brew "lazydocker"                  # docker terminal UI https://github.com/jesseduffield/lazydocker
brew "lazygit"                     # git terminal ui https://github.com/jesseduffield/lazygit
brew "libpq"                       # postgres api library https://www.postgresql.org/docs/14/libpq.html
brew "librsvg"                     # svg library https://wiki.gnome.org/Projects/LibRsvg
brew "links"                       # browser http://links.twibright.com/
brew "lua"                         # https://www.lua.org/
brew "lxc"                         # lxd cli https://linuxcontainers.org/
brew "mas"                         # mac app store cli https://github.com/mas-cli/mas
brew "minikube"                    # local k8s cluster https://minikube.sigs.k8s.io/docs/
brew "mkcert"                      # create local CA https://github.com/FiloSottile/mkcert
brew "mongocli"                    # mongodb cli https://github.com/mongodb/mongodb-atlas-cli
brew "navi"                        # cheatsheet https://github.com/denisidoro/navi
brew "ncrack"                      # network auth cracking https://nmap.org/ncrack/
brew "neovim"                      # vim fork https://neovim.io/
brew "netcat"                      # manage network connection https://netcat.sourceforge.io/
brew "nmap"                        # port scanner https://nmap.org/
brew "oha"                         # http load generator https://formulae.brew.sh/formula/oha
brew "okteto"                      # dev in k8s https://okteto.com/
brew "openjdk"                     # jdk https://openjdk.java.net/
brew "openssh"                     # ssh conectivity tool https://www.openssh.com/
brew "openssl"                     # Cryptography and SSL/TLS Toolkit https://openssl.org/
brew "p7zip"                       # 7zip https://github.com/p7zip-project/p7zip
brew "pgcli"                       # postgres cli https://www.pgcli.com/
brew "pkgx"                        # pkgx “run anything” https://github.com/pkgxdev/pkgx
brew "pnpm"                        # node package manager https://pnpm.io/
brew "poppler"                     # pdf toolkit https://poppler.freedesktop.org/
brew "portaudio"                   # audio library https://www.portaudio.com/
brew "protobuf"                    # data interchange format https://github.com/protocolbuffers/protobuf/
brew "pstree"                      # ps as tree http://www.thp.uni-duisburg.de/pstree/
brew "pulumi"                      # cloud native dev platform https://pulumi.io/
brew "pyenv"                       # python version management https://github.com/pyenv/pyenv
brew "python3"                     # python https://www.python.org/
brew "rclone"                      # rsync for cloud storage https://rclone.org/
brew "replibyte"                   # replibyte database seed https://github.com/qovery/replibyte
brew "rsync"                       # incremental file transfer https://rsync.samba.org/
brew "rustup-init"                 # Rust toolchain installer  https://github.com/rust-lang/rustup
brew "scrcpy"                      # android screen mirroring https://github.com/Genymobile/scrcpy
brew "speedtest"                   # speedtest cli https://www.speedtest.net/
brew "sqld"                        # LibSQL https://github.com/libsql/sqld
brew "sqlite"                      # sqlite CLI https://sqlite.org/index.html
brew "stern"                       # tail multiple pods on k8s https://github.com/stern/stern
brew "stow"                        # symlink manager https://www.gnu.org/software/stow/
brew "subversion"                  # svn https://subversion.apache.org/
brew "svn"                         # svn
brew "syncthing"                   # file sync tool https://syncthing.net/
brew "telnet"                      # telent cli https://opensource.apple.com/
brew "the_silver_searcher"         # code search https://github.com/ggreer/the_silver_searcher
brew "tldr"                        # man page https://tldr.sh/
brew "tmux"                        # terminal multiplexer https://github.com/tmux/tmux/wiki
brew "tree"                        # recurive dir listing http://mama.indstate.edu/users/ice/tree/
brew "turso"                       # turso cli https://github.com/tursodatabase/turso-cli
brew "unar"                        # unarchiving tool https://theunarchiver.com/command-line
brew "walk"                        # walk file tree https://github.com/antonmedv/walk
brew "watch"                       # execure cmd periodically https://gitlab.com/procps-ng/procps
brew "websocat"                    # telnet-like for websockets https://github.com/vi/websocat
brew "wget"                        # file retriver https://www.gnu.org/software/wget/
brew "wrk"                         # http benchmarking https://github.com/wg/wrk
brew "yarn"                        # js package manager https://yarnpkg.com/
brew "youtube-dl"                  # yt downloader https://youtube-dl.org/

cask "font-caskaydia-cove-nerd-font"
cask "font-consolas-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "font-meslo-lg-dz"
cask "font-meslo-lg-nerd-font"
cask "font-meslo-lg"
cask "font-source-code-pro"

cask "1password-cli"               # 1password cli https://1password.com/
cask "alt-tab"                    # alt-tab replacement https://alt-tab-macos.netlify.app/
cask "cloudflare-warp"            # warp client https://cloudflarewarp.com/
cask "docker"                     # container runtime https://www.docker.com/
cask "dozer"                      # hide status bar icons https://github.com/Mortennn/Dozer
cask "espanso"                    # text expander https://espanso.org/
cask "figma"                      # collabrartive team https://www.figma.com/
cask "firefox"                    # firefox browser https://www.mozilla.org/firefox/
cask "google-chrome"              # google chrome browser https://www.google.com/chrome/
cask "google-cloud-sdk"           # gcp cli, sdks https://cloud.google.com/sdk/
cask "hovrly"                     # hovrly https://github.com/tarutin/hovrly
cask "iina"                       # iina https://iina.io/
cask "istat-menus"                # system monitor app https://bjango.com/mac/istatmenus/
cask "iterm2"                     # terminal emulator https://www.iterm2.com/
cask "jetbrains-toolbox"          # jetbrains tools manager https://www.jetbrains.com/toolbox-app/
cask "lens"                       # k8s ide https://k8slens.dev/
cask "maccy"                      # clipboard manager https://maccy.app/
cask "microsoft-edge"             # microsoft edge https://www.microsoft.com/en-us/edge
cask "microsoft-office"           # ms office https://products.office.com/mac/microsoft-office-for-mac/
cask "mitmproxy"                   # https proxy https://mitmproxy.org/
cask "muzzle"                     # silence notifications https://muzzleapp.com/
cask "obsidian"                   # md editor https://obsidian.md/
cask "orbstack"                   # orbstack https://github.com/orbstack/orbstack
cask "postman"                    # api development https://www.postman.com/
cask "proxyman"                   # proxyman https://proxyman.io/
cask "rar"                        # rar archiver https://www.rarlab.com/
cask "raycast"                    # spotlight replacement https://raycast.com/
cask "rectangle"                  # window snap area https://rectangleapp.com/
cask "secretive"                  # store ssh in secure https://github.com/maxgoedjen/secretive
cask "shottr"                     # screenshot tool https://shottr.cc/
cask "stretchly"                  # break time reminder https://hovancik.net/stretchly/
cask "visual-studio-code"         # code editor https://code.visualstudio.com/
cask "vlc"                        # multimedia player
cask "webtorrent"                 # torrent client https://webtorrent.io/

mas "QuickShade", id: 931571202
