tap "cloudflare/cloudflare"
tap "cockroachdb/tap"
tap "datawire/blackbird"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "moncho/dry"
tap "teamookla/speedtest"
tap "vmware-tanzu/carvel"

brew "ack"                         # search tool https://beyondgrep.com/
brew "ansible"                     # ansible cli https://www.ansible.com/
brew "asciinema"                   # record & share terminal session https://asciinema.org/
brew "automake"                    # makefile generator https://www.gnu.org/software/automake/
brew "aws-vault"                   # aws secret storage https://github.com/99designs/aws-vault
brew "bat"                         # styled cat https://github.com/sharkdp/bat
brew "broot"                       # navigate directory trees https://dystroy.org/broot/
brew "caddy"                       # web server with https https://caddyserver.com/
brew "cloudflare-wrangler"         # cli for cf workers https://github.com/cloudflare/wrangler
brew "cloudflared"                 # cloudflare tunel client https://github.com/cloudflare/cloudflared
brew "cmake"                       # cross-platform make https://cmake.org/
brew "cockroach"                   # CockroachDB cli https://github.com/cockroachdb/homebrew-tap
brew "coredns"                     # dns server https://coredns.io/
brew "coreutils"                   # https://www.gnu.org/software/coreutils/
brew "curl"                        # https://curl.se/
brew "dry"                         # docker manager cli https://github.com/moncho/dry
brew "exa"                         # ls replacement https://the.exa.website/
brew "ffmpeg"                      # media tool https://ffmpeg.org/
brew "fswatch"                     # file change monitor https://github.com/emcrisostomo/fswatch
brew "fx"                          # json processing https://github.com/antonmedv/fx
brew "gh"                          # github cli https://cli.github.com
brew "git-lfs"                     # versioning large files https://github.com/git-lfs/git-lfs
brew "git"                         # git https://git-scm.com/
brew "gnupg"                       # privacy package https://gnupg.org/
brew "go"                          # https://go.dev/
brew "gping"                       # ping with graph https://github.com/orf/gping
brew "h2o"                         # HTTP/1.x and HTTP/2 server https://github.com/h2o/h2o/
brew "hashicorp/tap/boundary"      # secure remote access https://www.boundaryproject.io/
brew "hashicorp/tap/consul"        # service mesh from hc https://www.consul.io/
brew "hashicorp/tap/nomad"         # scheduler and workload orchestrator https://www.nomadproject.io/
brew "hashicorp/tap/packer"        # auomate machine image https://www.packer.io/
brew "hashicorp/tap/terraform"     # terraform https://www.terraform.io/
brew "hashicorp/tap/waypoint"      # app deployment https://www.waypointproject.io/
brew "helm"                        # k8s package manager https://helm.sh/
brew "heroku"                      # heroku cli https://www.heroku.com/
brew "hss"                         # parallel ssh client https://github.com/six-ddc/hss
brew "http-server"                 # https://github.com/http-party/http-server
brew "httpie"                      # cURL replacement https://httpie.io/
brew "iftop"                       # interface bandwidth usage https://www.ex-parrot.com/~pdw/iftop/
brew "imagemagick"                 # manipulate images https://imagemagick.org/index.php
brew "iperf3"                      # mesure tcp, udp bandwidth https://github.com/esnet/iperf
brew "jq"                          # JSON processor https://stedolan.github.io/jq/
brew "k6"                          # load testing https://k6.io/
brew "k9s"                         # k8s cli/ui https://k9scli.io/
brew "kind"                        # local k8s cluster https://kind.sigs.k8s.io/
brew "krew"                        # kubectl plugins manager https://sigs.k8s.io/krew/
brew "kubectx"                     # mange k8s ctx https://github.com/ahmetb/kubectx
brew "kubergrunt"                  # https://github.com/gruntwork-io/kubergrunt
brew "kubernetes-cli"              # kubectl https://kubernetes.io/
brew "kubespy"                     # observing k8s resources in realtime https://github.com/pulumi/kubespy
brew "lazydocker"                  # docker terminal UI https://github.com/jesseduffield/lazydocker
brew "libpq"                       # postgres api library https://www.postgresql.org/docs/14/libpq.html
brew "links"                       # browser http://links.twibright.com/
brew "lxc"                         # lxd cli https://linuxcontainers.org/
brew "mas"                         # mac app store cli https://github.com/mas-cli/mas
brew "minikube"                    # local k8s cluster https://minikube.sigs.k8s.io/docs/
brew "mitmproxy"                   # https proxy https://mitmproxy.org/
brew "ncrack"                      # network auth cracking https://nmap.org/ncrack/
brew "netcat"                      # manage network connection https://netcat.sourceforge.io/
brew "nmap"                        # port scanner https://nmap.org/
brew "okteto"                      # dev in k8s https://okteto.com/
brew "openjdk"                     # jdk https://openjdk.java.net/
brew "openssh"                     # ssh conectivity tool https://www.openssh.com/
brew "openssl"                     # Cryptography and SSL/TLS Toolkit https://openssl.org/
brew "protobuf"                    # data interchange format https://github.com/protocolbuffers/protobuf/
brew "pstree"                      # ps as tree http://www.thp.uni-duisburg.de/pstree/
brew "pulumi"                      # cloud native dev platform https://pulumi.io/
brew "pyenv"                       # python version management https://github.com/pyenv/pyenv
brew "python@3.7"                  # python@3.7 https://www.python.org/
brew "python3"                     # python https://www.python.org/
brew "rclone"                      # rsync for cloud storage https://rclone.org/
brew "rsync"                       # incremental file transfer https://rsync.samba.org/
brew "rustup-init"                 # Rust toolchain installer  https://github.com/rust-lang/rustup
brew "speedtest"                   # speedtest cli https://www.speedtest.net/
brew "sqlite"                      # sqlite CLI https://sqlite.org/index.html
brew "stern"                       # tail multiple pods on k8s https://github.com/stern/stern
brew "stow"                        # symlink manager https://www.gnu.org/software/stow/
brew "svn"                         # svn
brew "syncthing"                   # file sync tool https://syncthing.net/
brew "telepresence"                # fast local k8s development https://www.telepresence.io/
brew "telnet"                      # telent cli https://opensource.apple.com/
brew "tldr"                        # man page https://tldr.sh/
brew "tmux"                        # terminal multiplexer https://github.com/tmux/tmux/wiki
brew "tree"                        # recurive dir listing http://mama.indstate.edu/users/ice/tree/
brew "unar"                        # unarchiving tool https://theunarchiver.com/command-line
brew "watch"                       # execure cmd periodically https://gitlab.com/procps-ng/procps
brew "websocat"                    # telnet-like for websockets https://github.com/vi/websocat
brew "wget"                        # file retriver https://www.gnu.org/software/wget/
brew "yarn"                        # js package manager https://yarnpkg.com/
brew "youtube-dl"                  # yt downloader https://youtube-dl.org/

cask "font-caskaydia-cove-nerd-font"
cask "font-consolas-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "font-meslo-lg-dz"
cask "font-meslo-lg-nerd-font"
cask "font-meslo-lg"
cask "font-source-code-pro"

cask "adobe-creative-cloud"       # adobe toolbox https://www.adobe.com/creativecloud.html
cask "altair-graphql-client"      # graphql client https://altair.sirmuel.design/
cask "brave-browser"              # privacy focused browser https://brave.com/
cask "burp-suite-professional"    # professional security testing https://portswigger.net/burp/pro
cask "burp-suite"                 # security testing https://portswigger.net/burp/
cask "clickup"                    # productivity platform https://clickup.com/
cask "cloudflare-warp"            # warp client https://cloudflarewarp.com/
cask "discord"                    # voice text https://discord.com/
cask "docker"                     # container runtime https://www.docker.com/
cask "dozer"                      # hide status bar icons https://github.com/Mortennn/Dozer
cask "fig"                        # terminal autocomplete https://fig.io/
cask "figma"                      # collabrartive team https://www.figma.com/
cask "firefox"                    # firefox browser https://www.mozilla.org/firefox/
cask "google-chrome"              # google chrome browser https://www.google.com/chrome/
cask "google-cloud-sdk"           # gcp cli, sdks https://cloud.google.com/sdk/
cask "google-drive"               # google drive client https://www.google.com/drive/
cask "insomnia"                   # http & graphql client https://insomnia.rest/
cask "istat-menus"                # system monitor app https://bjango.com/mac/istatmenus/
cask "iterm2"                     # terminal emulator https://www.iterm2.com/
cask "jetbrains-toolbox"          # jetbrains tools manager https://www.jetbrains.com/toolbox-app/
cask "lens"                       # k8s ide https://k8slens.dev/
cask "maccy"                      # cloipboard manager https://maccy.app/
cask "meetingbar"                 # show meeting in menubar https://github.com/leits/MeetingBar
cask "microsoft-office"           # ms office https://products.office.com/mac/microsoft-office-for-mac/
cask "mockoon"                    # mock api local https://mockoon.com/
cask "multipass"                  # orchestrates virtual ubuntu instances https://github.com/canonical/multipass/
cask "muzzle"                     # silence notifications https://muzzleapp.com/
cask "notion"                     # notion https://www.notion.so/
cask "obsidian"                   # md editor https://obsidian.md/
cask "postman"                    # api development https://www.postman.com/
cask "rectangle"                  # window snap area https://rectangleapp.com/
cask "secretive"                   # store ssh in secure https://github.com/maxgoedjen/secretive
cask "slack"                      # team communication https://slack.com/
cask "sourcetree"                 # git client https://www.sourcetreeapp.com/
cask "stretchly"                  # break time reminder https://hovancik.net/stretchly/
cask "tower"                      # git client
cask "vagrant-manager"            # vagrant manager https://www.vagrantmanager.com/
cask "vagrant"                    # dev environment https://www.vagrantup.com/
cask "virtualbox"                 # virtualizer https://www.virtualbox.org/
cask "visual-studio-code"         # code editor https://code.visualstudio.com/
cask "vlc"                        # multimedia player
cask "webex"                      # video communication https://www.webex.com/
cask "zoom"                       # video communication https://www.zoom.us/

mas "LastPass Password Manager", id: 926036361